# Λεξικό στην Python
# Ένα λεξικό είναι μια συλλογή που δεν είναι ταξινομημένη, αλλάζει και ευρετηριάζεται. 
# Στην Python τα λεξικά γράφονται με αγκύλες και έχουν κλειδιά και τιμές.
# Μπορείτε να αποκτήσετε πρόσβαση στα στοιχεία ενός λεξικού αναφέροντας το βασικό του όνομα μέσα σε αγκύλες

dit = {                                                          # Δημιουργία λεξικού με όνομα dit
    "departmeny" : "Informatics and Telecommunications",         # Δεδομένα λεξικού 
    "university" : "Ioannina"
}  

un = dit["university"]                                           #Αναζήτηση στοιχείου 
print(un)

print(dit)

