# Για να ελέγξετε εάν έχετε εγκαταστήσει το python σε υπολογιστή με Windows, 
# αναζητήστε στη γραμμή εκκίνησης το Python ή εκτελέστε τα ακόλουθα 
# στη γραμμή εντολών (cmd.exe):

# τρέξτε στο cmd: python --version για να δείτε εαν έχετε κατεβάσει την python 

# Εάν διαπιστώσετε ότι δεν έχετε εγκαταστήσει το python στον υπολογιστή σας, 
# τότε μπορείτε να το κατεβάσετε δωρεάν από τον ακόλουθο ιστότοπο: https://www.python.org/

# Μετά την συγγραφή ενός προγράμματος πρέπει να γίνει αποθήκευση (όνομα_αρχείου.py)

#Για την εκτέλεση ενός προγράμματος μπορείτε μέσω του cmd με την εντολή python όνομα_αρχείου.py να τρέξετε το πρόγραμμα σας