# Λίστα σε Python

ls = ["dit", "uoi", "arta"]
print(ls)

print("------------------------------------------")

print(ls[0])
print(ls[1])
print(ls[2])

print("------------------------------------------")

print(ls[-1])

print("------------------------------------------")

print(ls[0:2])

print("------------------------------------------")

ls.insert(1, "ioannina")    # Εισαγωγή ενός στοιχείου στην λίστα
print(ls)

print("------------------------------------------")

ls.remove("ioannina")   # Αφαίρεση ενός στοιχείου απο την λίστα
print(ls)

print("------------------------------------------")

k = ls.copy()   # Αντιγραφή λίστας
print(k)

