
# Αλφαριθμητικά στην Python

x = '''Στόχος του τμήματος είναι η προώθηση των επιστημών της πληροφορικής, 
των υπολογιστικών συστημάτων και των τηλεπικοινωνιών, καθώς και των εφαρμογών αυτών. 
Το Τμήμα διαθέτει σύγχρονες υποδομές στο campus της Πανεπιστημιούπολης της ιστορικής πόλης της Άρτας.'''

print(x)
print("-----------------------------------------------------------")

y = "Hello World!"
print(y[0])     # Παίρνει τους χαρακτήρες από τη θέση 0
print(y[6:11])  # Παίρνει τους χαρακτήρες από τη θέση 6 μέχρι την θέση 11
print("-----------------------------------------------------------")

print(len(y))   # Επιστρέφει το μήκος μιας συμβολοσειράς

k = "  DIT"
m = "dit"
print(k.strip())    # Καταργεί οποιοδήποτε κενό διάστημα από την αρχή ή το τέλος
print("----------------------------------------------------------")

print(k.lower())    # Επιστρέφει τη συμβολοσειρά με πεζά γράμματα
print("----------------------------------------------------------")

print(m.upper())    # Επιστρέφει τη συμβολοσειρά με κεφαλαία γράμματα
print("----------------------------------------------------------")

l="Tit"
print(l.replace("T", "D"))  # Αντικαθιστά μια συμβολοσειρά με μια άλλη συμβολοσειρά
print("----------------------------------------------------------")

q="DIT - UOI"
print(q.split("-"))
print("----------------------------------------------------------")

a = "DIT"
b = "I" in a    # Ελέγξτε εάν η φράση "I" υπάρχει στο ακόλουθο κείμενο
print(b)
print("----------------------------------------------------------")

b = "o" not in a    # Ελέγξτε αν η φράση "I" ΔΕΝ υπάρχει στο ακόλουθο κείμενο
print(b)
print("----------------------------------------------------------")

a = "Hello"
b = "World"
c = a + b   # Συγχώνευση μεταβλητής a με μεταβλητή b σε μεταβλητή c
print(c)

c = a + "   " + b
print(c)

age = 21
txt = "My name is Kostas, and I am {}"
print(txt.format(age))  # Η μέθοδος format () παίρνει τα ορίσματα που έχουν περάσει, τα μορφοποιεί,
                        # και τα τοποθετεί στη συμβολοσειρά ανάμεσα στα {}

kr = "DIT--\"UOI\"."    # Ο χαρακτήρας διαφυγής σάς επιτρέπει να χρησιμοποιείτε διπλά 
                        # εισαγωγικά όταν κανονικά δεν θα επιτρέπετε
print(kr)
